nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/dma/processor/dma_p32mk0512mcf100.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _DMA_P32MK0512MCF100_H
#define _DMA_P32MK0512MCF100_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

typedef enum {

    DMA_ID_0 = _DMAC_BASE_ADDRESS,
    DMA_NUMBER_OF_MODULES = 1

} DMA_MODULE_ID;

typedef enum {

    DMA_CHANNEL_0 = 0x0,
    DMA_CHANNEL_1 = 0x1,
    DMA_CHANNEL_2 = 0x2,
    DMA_CHANNEL_3 = 0x3,
    DMA_CHANNEL_4 = 0x4,
    DMA_CHANNEL_5 = 0x5,
    DMA_CHANNEL_6 = 0x6,
    DMA_CHANNEL_7 = 0x7,
    DMA_NUMBER_OF_CHANNELS = 0x8

} DMA_CHANNEL;

typedef enum {

    DMA_CHANNEL_0_INT_SOURCE = 72,
    DMA_CHANNEL_1_INT_SOURCE = 73,
    DMA_CHANNEL_2_INT_SOURCE = 74,
    DMA_CHANNEL_3_INT_SOURCE = 75,
    DMA_CHANNEL_4_INT_SOURCE = 182,
    DMA_CHANNEL_5_INT_SOURCE = 183,
    DMA_CHANNEL_6_INT_SOURCE = 184,
    DMA_CHANNEL_7_INT_SOURCE = 185

} DMA_CHANNEL_INT_SOURCE;

typedef enum {

    DMA_CHANNEL_PRIORITY_0 = 0x0,
    DMA_CHANNEL_PRIORITY_1 = 0x1,
    DMA_CHANNEL_PRIORITY_2 = 0x2,
    DMA_CHANNEL_PRIORITY_3 = 0x3

} DMA_CHANNEL_PRIORITY;

typedef enum {

    DMA_CHANNEL_TRIGGER_TRANSFER_START = 0x0,
    DMA_CHANNEL_TRIGGER_TRANSFER_ABORT = 0x1,
    DMA_CHANNEL_TRIGGER_PATTERN_MATCH_ABORT = 0x2

} DMA_CHANNEL_TRIGGER_TYPE;

typedef enum {

    DMA_TRIGGER_SOURCE_NONE = -1,
    DMA_TRIGGER_TIMER_CORE = 0,
    DMA_TRIGGER_SOFTWARE_0 = 1,
    DMA_TRIGGER_SOFTWARE_1 = 2,
    DMA_TRIGGER_EXTERNAL_0 = 3,
    DMA_TRIGGER_EXTERNAL_1 = 8,
    DMA_TRIGGER_EXTERNAL_2 = 13,
    DMA_TRIGGER_EXTERNAL_3 = 18,
    DMA_TRIGGER_EXTERNAL_4 = 23,
    DMA_TRIGGER_TIMER_1 = 4,
    DMA_TRIGGER_TIMER_2 = 9,
    DMA_TRIGGER_TIMER_3 = 14,
    DMA_TRIGGER_TIMER_4 = 19,
    DMA_TRIGGER_TIMER_5 = 24,
    DMA_TRIGGER_TIMER_6 = 76,
    DMA_TRIGGER_TIMER_7 = 80,
    DMA_TRIGGER_TIMER_8 = 84,
    DMA_TRIGGER_TIMER_9 = 88,
    DMA_TRIGGER_INPUT_CAPTURE_1 = 6,
    DMA_TRIGGER_INPUT_CAPTURE_2 = 11,
    DMA_TRIGGER_INPUT_CAPTURE_3 = 16,
    DMA_TRIGGER_INPUT_CAPTURE_4 = 21,
    DMA_TRIGGER_INPUT_CAPTURE_5 = 26,
    DMA_TRIGGER_INPUT_CAPTURE_6 = 78,
    DMA_TRIGGER_INPUT_CAPTURE_7 = 82,
    DMA_TRIGGER_INPUT_CAPTURE_8 = 86,
    DMA_TRIGGER_INPUT_CAPTURE_9 = 90,
    DMA_TRIGGER_INPUT_CAPTURE_10 = 198,
    DMA_TRIGGER_INPUT_CAPTURE_11 = 201,
    DMA_TRIGGER_INPUT_CAPTURE_12 = 204,
    DMA_TRIGGER_INPUT_CAPTURE_13 = 207,
    DMA_TRIGGER_INPUT_CAPTURE_14 = 210,
    DMA_TRIGGER_INPUT_CAPTURE_15 = 213,
    DMA_TRIGGER_INPUT_CAPTURE_16 = 216,
    DMA_TRIGGER_INPUT_CAPTURE_1_ERROR = 5,
    DMA_TRIGGER_INPUT_CAPTURE_2_ERROR = 10,
    DMA_TRIGGER_INPUT_CAPTURE_3_ERROR = 15,
    DMA_TRIGGER_INPUT_CAPTURE_4_ERROR = 20,
    DMA_TRIGGER_INPUT_CAPTURE_5_ERROR = 25,
    DMA_TRIGGER_INPUT_CAPTURE_6_ERROR = 77,
    DMA_TRIGGER_INPUT_CAPTURE_7_ERROR = 81,
    DMA_TRIGGER_INPUT_CAPTURE_8_ERROR = 85,
    DMA_TRIGGER_INPUT_CAPTURE_9_ERROR = 89,
    DMA_TRIGGER_INPUT_CAPTURE_10_ERROR = 197,
    DMA_TRIGGER_INPUT_CAPTURE_11_ERROR = 200,
    DMA_TRIGGER_INPUT_CAPTURE_12_ERROR = 203,
    DMA_TRIGGER_INPUT_CAPTURE_13_ERROR = 206,
    DMA_TRIGGER_INPUT_CAPTURE_14_ERROR = 209,
    DMA_TRIGGER_INPUT_CAPTURE_15_ERROR = 212,
    DMA_TRIGGER_INPUT_CAPTURE_16_ERROR = 215,
    DMA_TRIGGER_OUTPUT_COMPARE_1 = 7,
    DMA_TRIGGER_OUTPUT_COMPARE_2 = 12,
    DMA_TRIGGER_OUTPUT_COMPARE_3 = 17,
    DMA_TRIGGER_OUTPUT_COMPARE_4 = 22,
    DMA_TRIGGER_OUTPUT_COMPARE_5 = 27,
    DMA_TRIGGER_OUTPUT_COMPARE_6 = 79,
    DMA_TRIGGER_OUTPUT_COMPARE_7 = 83,
    DMA_TRIGGER_OUTPUT_COMPARE_8 = 87,
    DMA_TRIGGER_OUTPUT_COMPARE_9 = 91,
    DMA_TRIGGER_OUTPUT_COMPARE_10 = 199,
    DMA_TRIGGER_OUTPUT_COMPARE_11 = 202,
    DMA_TRIGGER_OUTPUT_COMPARE_12 = 205,
    DMA_TRIGGER_OUTPUT_COMPARE_13 = 208,
    DMA_TRIGGER_OUTPUT_COMPARE_14 = 211,
    DMA_TRIGGER_OUTPUT_COMPARE_15 = 214,
    DMA_TRIGGER_OUTPUT_COMPARE_16 = 217,
    DMA_TRIGGER_SPI_1_ERROR = 35,
    DMA_TRIGGER_SPI_1_RECEIVE = 36,
    DMA_TRIGGER_SPI_1_TRANSMIT = 37,
    DMA_TRIGGER_SPI_2_ERROR = 53,
    DMA_TRIGGER_SPI_2_RECEIVE = 54,
    DMA_TRIGGER_SPI_2_TRANSMIT = 55,
    DMA_TRIGGER_SPI_3_ERROR = 218,
    DMA_TRIGGER_SPI_3_RECEIVE = 219,
    DMA_TRIGGER_SPI_3_TRANSMIT = 220,
    DMA_TRIGGER_SPI_4_ERROR = 221,
    DMA_TRIGGER_SPI_4_RECEIVE = 222,
    DMA_TRIGGER_SPI_4_TRANSMIT = 223,
    DMA_TRIGGER_SPI_5_ERROR = 224,
    DMA_TRIGGER_SPI_5_RECEIVE = 225,
    DMA_TRIGGER_SPI_5_TRANSMIT = 226,
    DMA_TRIGGER_SPI_6_ERROR = 227,
    DMA_TRIGGER_SPI_6_RECEIVE = 228,
    DMA_TRIGGER_SPI_6_TRANSMIT = 229,
    DMA_TRIGGER_I2C_1_ERROR = 41,
    DMA_TRIGGER_I2C_1_SLAVE = 42,
    DMA_TRIGGER_I2C_1_MASTER = 43,
    DMA_TRIGGER_I2C_2_ERROR = 59,
    DMA_TRIGGER_I2C_2_SLAVE = 60,
    DMA_TRIGGER_I2C_2_MASTER = 61,
    DMA_TRIGGER_I2C_3_ERROR = 179,
    DMA_TRIGGER_I2C_3_SLAVE = 180,
    DMA_TRIGGER_I2C_3_MASTER = 181,
    DMA_TRIGGER_I2C_4_ERROR = 194,
    DMA_TRIGGER_I2C_4_SLAVE = 195,
    DMA_TRIGGER_I2C_4_MASTER = 196,
    DMA_TRIGGER_USART_1_ERROR = 38,
    DMA_TRIGGER_USART_1_RECEIVE = 39,
    DMA_TRIGGER_USART_1_TRANSMIT = 40,
    DMA_TRIGGER_USART_2_ERROR = 56,
    DMA_TRIGGER_USART_2_RECEIVE = 57,
    DMA_TRIGGER_USART_2_TRANSMIT = 58,
    DMA_TRIGGER_USART_3_ERROR = 62,
    DMA_TRIGGER_USART_3_RECEIVE = 63,
    DMA_TRIGGER_USART_3_TRANSMIT = 64,
    DMA_TRIGGER_USART_4_ERROR = 65,
    DMA_TRIGGER_USART_4_RECEIVE = 66,
    DMA_TRIGGER_USART_4_TRANSMIT = 67,
    DMA_TRIGGER_USART_5_ERROR = 68,
    DMA_TRIGGER_USART_5_RECEIVE = 69,
    DMA_TRIGGER_USART_5_TRANSMIT = 70,
    DMA_TRIGGER_USART_6_ERROR = 164,
    DMA_TRIGGER_USART_6_RECEIVE = 165,
    DMA_TRIGGER_USART_6_TRANSMIT = 166,
    DMA_TRIGGER_CHANGE_NOTICE_A = 44,
    DMA_TRIGGER_CHANGE_NOTICE_B = 45,
    DMA_TRIGGER_CHANGE_NOTICE_C = 46,
    DMA_TRIGGER_CHANGE_NOTICE_D = 47,
    DMA_TRIGGER_CHANGE_NOTICE_E = 48,
    DMA_TRIGGER_CHANGE_NOTICE_F = 49,
    DMA_TRIGGER_CHANGE_NOTICE_G = 50,
    DMA_TRIGGER_DMA_0 = 72,
    DMA_TRIGGER_DMA_1 = 73,
    DMA_TRIGGER_DMA_2 = 74,
    DMA_TRIGGER_DMA_3 = 75,
    DMA_TRIGGER_DMA_4 = 182,
    DMA_TRIGGER_DMA_5 = 183,
    DMA_TRIGGER_DMA_6 = 184,
    DMA_TRIGGER_DMA_7 = 185,
    DMA_TRIGGER_DATA_EE = 186,
    DMA_TRIGGER_COMPARATOR_1 = 32,
    DMA_TRIGGER_COMPARATOR_2 = 33,
    DMA_TRIGGER_COMPARATOR_3 = 160,
    DMA_TRIGGER_COMPARATOR_4 = 161,
    DMA_TRIGGER_COMPARATOR_5 = 162,
    DMA_TRIGGER_ADC_DC1 = 94,
    DMA_TRIGGER_ADC_DC2 = 95,
    DMA_TRIGGER_ADC_DC3 = 245,
    DMA_TRIGGER_ADC_DC4 = 246,
    DMA_TRIGGER_ADC_DF1 = 96,
    DMA_TRIGGER_ADC_DF2 = 97,
    DMA_TRIGGER_ADC_DF3 = 98,
    DMA_TRIGGER_ADC_DF4 = 99,
    DMA_TRIGGER_ADC_FAULT = 100,
    DMA_TRIGGER_ADC_DATA0 = 106,
    DMA_TRIGGER_ADC_DATA1 = 107,
    DMA_TRIGGER_ADC_DATA2 = 108,
    DMA_TRIGGER_ADC_DATA3 = 109,
    DMA_TRIGGER_ADC_DATA4 = 110,
    DMA_TRIGGER_ADC_DATA5 = 111,
    DMA_TRIGGER_ADC_DATA6 = 112,
    DMA_TRIGGER_ADC_DATA7 = 113,
    DMA_TRIGGER_ADC_DATA8 = 114,
    DMA_TRIGGER_ADC_DATA9 = 115,
    DMA_TRIGGER_ADC_DATA10 = 116,
    DMA_TRIGGER_ADC_DATA11 = 117,
    DMA_TRIGGER_ADC_DATA12 = 118,
    DMA_TRIGGER_ADC_DATA13 = 119,
    DMA_TRIGGER_ADC_DATA14 = 120,
    DMA_TRIGGER_ADC_DATA15 = 121,
    DMA_TRIGGER_ADC_DATA16 = 122,
    DMA_TRIGGER_ADC_DATA17 = 123,
    DMA_TRIGGER_ADC_DATA18 = 124,
    DMA_TRIGGER_ADC_DATA19 = 125,
    DMA_TRIGGER_ADC_DATA20 = 126,
    DMA_TRIGGER_ADC_DATA21 = 127,
    DMA_TRIGGER_ADC_DATA22 = 128,
    DMA_TRIGGER_ADC_DATA23 = 129,
    DMA_TRIGGER_ADC_DATA24 = 130,
    DMA_TRIGGER_ADC_DATA25 = 131,
    DMA_TRIGGER_ADC_DATA26 = 132,
    DMA_TRIGGER_ADC_DATA27 = 133,
    DMA_TRIGGER_ADC_DATA33 = 139,
    DMA_TRIGGER_ADC_DATA34 = 140,
    DMA_TRIGGER_ADC_DATA35 = 141,
    DMA_TRIGGER_ADC_DATA36 = 142,
    DMA_TRIGGER_ADC_DATA37 = 143,
    DMA_TRIGGER_ADC_DATA38 = 144,
    DMA_TRIGGER_ADC_DATA39 = 145,
    DMA_TRIGGER_ADC_DATA40 = 146,
    DMA_TRIGGER_ADC_DATA41 = 147,
    DMA_TRIGGER_ADC_DATA45 = 151,
    DMA_TRIGGER_ADC_DATA46 = 152,
    DMA_TRIGGER_ADC_DATA47 = 153,
    DMA_TRIGGER_ADC_DATA48 = 154,
    DMA_TRIGGER_ADC_DATA49 = 155,
    DMA_TRIGGER_ADC_DATA50 = 156,
    DMA_TRIGGER_ADC_DATA51 = 157,
    DMA_TRIGGER_ADC_DATA52 = 158,
    DMA_TRIGGER_ADC_DATA53 = 159,
    DMA_TRIGGER_CORE_PERF_COUNT = 254,
    DMA_TRIGGER_CORE_FAST_DEBUG_CHAN = 255,
    DMA_TRIGGER_SYSTEM_BUS_PROTECTION = 230,
    DMA_TRIGGER_PARALLEL_PORT = 51,
    DMA_TRIGGER_CAN_1 = 167,
    DMA_TRIGGER_CAN_2 = 168,
    DMA_TRIGGER_CAN_3 = 187,
    DMA_TRIGGER_CAN_4 = 188,
    DMA_TRIGGER_RTCC = 30,
    DMA_TRIGGER_FLASH_CONTROL = 31,
    DMA_TRIGGER_USB_1 = 34,
    DMA_TRIGGER_USB_2 = 244,
    DMA_TRIGGER_PARALLEL_PORT_ERROR = 52,
    DMA_TRIGGER_CTMU = 71,
    DMA_TRIGGER_ADC_EOS = 101,
    DMA_TRIGGER_ADC_ARDY = 102,
    DMA_TRIGGER_ADC_URDY = 103,
    DMA_TRIGGER_ADC_DMA = 104,
    DMA_TRIGGER_ADC_EARLY = 105,
	DMA_TRIGGER_QEI1 = 169,
	DMA_TRIGGER_QEI2 = 170,
	DMA_TRIGGER_QEI3 = 189,
	DMA_TRIGGER_QEI4 = 190,
	DMA_TRIGGER_QEI5 = 191,
	DMA_TRIGGER_QEI6 = 192,
	DMA_TRIGGER_PWM_PRIMARY = 171,
	DMA_TRIGGER_PWM_SECONDARY = 172,
	DMA_TRIGGER_PWM1 = 173,
	DMA_TRIGGER_PWM2 = 174,
	DMA_TRIGGER_PWM3 = 175,
	DMA_TRIGGER_PWM4 = 176,
	DMA_TRIGGER_PWM5 = 177,
	DMA_TRIGGER_PWM6 = 178


} DMA_TRIGGER_SOURCE;

